veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S94WOP */
#define IFX_DMU_HP_PROCON_WOP2_S94WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S94WOP */
#define IFX_DMU_HP_PROCON_WOP2_S94WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S94WOP */
#define IFX_DMU_HP_PROCON_WOP2_S94WOP_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP2_Bits.S95WOP */
#define IFX_DMU_HP_PROCON_WOP2_S95WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP2_Bits.S95WOP */
#define IFX_DMU_HP_PROCON_WOP2_S95WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP2_Bits.S95WOP */
#define IFX_DMU_HP_PROCON_WOP2_S95WOP_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S96WOP */
#define IFX_DMU_HP_PROCON_WOP3_S96WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S96WOP */
#define IFX_DMU_HP_PROCON_WOP3_S96WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S96WOP */
#define IFX_DMU_HP_PROCON_WOP3_S96WOP_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S97WOP */
#define IFX_DMU_HP_PROCON_WOP3_S97WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S97WOP */
#define IFX_DMU_HP_PROCON_WOP3_S97WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S97WOP */
#define IFX_DMU_HP_PROCON_WOP3_S97WOP_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S98WOP */
#define IFX_DMU_HP_PROCON_WOP3_S98WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S98WOP */
#define IFX_DMU_HP_PROCON_WOP3_S98WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S98WOP */
#define IFX_DMU_HP_PROCON_WOP3_S98WOP_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S99WOP */
#define IFX_DMU_HP_PROCON_WOP3_S99WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S99WOP */
#define IFX_DMU_HP_PROCON_WOP3_S99WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S99WOP */
#define IFX_DMU_HP_PROCON_WOP3_S99WOP_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S100WOP */
#define IFX_DMU_HP_PROCON_WOP3_S100WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S100WOP */
#define IFX_DMU_HP_PROCON_WOP3_S100WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S100WOP */
#define IFX_DMU_HP_PROCON_WOP3_S100WOP_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S101WOP */
#define IFX_DMU_HP_PROCON_WOP3_S101WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S101WOP */
#define IFX_DMU_HP_PROCON_WOP3_S101WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S101WOP */
#define IFX_DMU_HP_PROCON_WOP3_S101WOP_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S102WOP */
#define IFX_DMU_HP_PROCON_WOP3_S102WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S102WOP */
#define IFX_DMU_HP_PROCON_WOP3_S102WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S102WOP */
#define IFX_DMU_HP_PROCON_WOP3_S102WOP_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S103WOP */
#define IFX_DMU_HP_PROCON_WOP3_S103WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S103WOP */
#define IFX_DMU_HP_PROCON_WOP3_S103WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S103WOP */
#define IFX_DMU_HP_PROCON_WOP3_S103WOP_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S104WOP */
#define IFX_DMU_HP_PROCON_WOP3_S104WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S104WOP */
#define IFX_DMU_HP_PROCON_WOP3_S104WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S104WOP */
#define IFX_DMU_HP_PROCON_WOP3_S104WOP_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S105WOP */
#define IFX_DMU_HP_PROCON_WOP3_S105WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S105WOP */
#define IFX_DMU_HP_PROCON_WOP3_S105WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S105WOP */
#define IFX_DMU_HP_PROCON_WOP3_S105WOP_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S106WOP */
#define IFX_DMU_HP_PROCON_WOP3_S106WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S106WOP */
#define IFX_DMU_HP_PROCON_WOP3_S106WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S106WOP */
#define IFX_DMU_HP_PROCON_WOP3_S106WOP_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S107WOP */
#define IFX_DMU_HP_PROCON_WOP3_S107WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S107WOP */
#define IFX_DMU_HP_PROCON_WOP3_S107WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S107WOP */
#define IFX_DMU_HP_PROCON_WOP3_S107WOP_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S108WOP */
#define IFX_DMU_HP_PROCON_WOP3_S108WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S108WOP */
#define IFX_DMU_HP_PROCON_WOP3_S108WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S108WOP */
#define IFX_DMU_HP_PROCON_WOP3_S108WOP_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S109WOP */
#define IFX_DMU_HP_PROCON_WOP3_S109WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S109WOP */
#define IFX_DMU_HP_PROCON_WOP3_S109WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S109WOP */
#define IFX_DMU_HP_PROCON_WOP3_S109WOP_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S110WOP */
#define IFX_DMU_HP_PROCON_WOP3_S110WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S110WOP */
#define IFX_DMU_HP_PROCON_WOP3_S110WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S110WOP */
#define IFX_DMU_HP_PROCON_WOP3_S110WOP_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S111WOP */
#define IFX_DMU_HP_PROCON_WOP3_S111WOP_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_WOP3_Bits.S111WOP */
#define IFX_DMU_HP_PROCON_WOP3_S111WOP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_WOP3_Bits.S111WOP */
#define IFX_DMU_HP_PROCON_WOP3_S111WOP_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_WOP3_Bits.S112WOP */
#define IFX_DMU_HP_PROCON_WOP3_S112WOP_LEN (1u)

