veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S101L */
#define IFX_DMU_HP_ECPRIO_P3_S101L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S101L */
#define IFX_DMU_HP_ECPRIO_P3_S101L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S101L */
#define IFX_DMU_HP_ECPRIO_P3_S101L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S102L */
#define IFX_DMU_HP_ECPRIO_P3_S102L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S102L */
#define IFX_DMU_HP_ECPRIO_P3_S102L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S102L */
#define IFX_DMU_HP_ECPRIO_P3_S102L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S103L */
#define IFX_DMU_HP_ECPRIO_P3_S103L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S103L */
#define IFX_DMU_HP_ECPRIO_P3_S103L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S103L */
#define IFX_DMU_HP_ECPRIO_P3_S103L_OFF (7u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S104L */
#define IFX_DMU_HP_ECPRIO_P3_S104L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S104L */
#define IFX_DMU_HP_ECPRIO_P3_S104L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S104L */
#define IFX_DMU_HP_ECPRIO_P3_S104L_OFF (8u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S105L */
#define IFX_DMU_HP_ECPRIO_P3_S105L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S105L */
#define IFX_DMU_HP_ECPRIO_P3_S105L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S105L */
#define IFX_DMU_HP_ECPRIO_P3_S105L_OFF (9u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S106L */
#define IFX_DMU_HP_ECPRIO_P3_S106L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S106L */
#define IFX_DMU_HP_ECPRIO_P3_S106L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S106L */
#define IFX_DMU_HP_ECPRIO_P3_S106L_OFF (10u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S107L */
#define IFX_DMU_HP_ECPRIO_P3_S107L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S107L */
#define IFX_DMU_HP_ECPRIO_P3_S107L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S107L */
#define IFX_DMU_HP_ECPRIO_P3_S107L_OFF (11u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S108L */
#define IFX_DMU_HP_ECPRIO_P3_S108L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S108L */
#define IFX_DMU_HP_ECPRIO_P3_S108L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S108L */
#define IFX_DMU_HP_ECPRIO_P3_S108L_OFF (12u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S109L */
#define IFX_DMU_HP_ECPRIO_P3_S109L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S109L */
#define IFX_DMU_HP_ECPRIO_P3_S109L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S109L */
#define IFX_DMU_HP_ECPRIO_P3_S109L_OFF (13u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S110L */
#define IFX_DMU_HP_ECPRIO_P3_S110L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S110L */
#define IFX_DMU_HP_ECPRIO_P3_S110L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S110L */
#define IFX_DMU_HP_ECPRIO_P3_S110L_OFF (14u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S111L */
#define IFX_DMU_HP_ECPRIO_P3_S111L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S111L */
#define IFX_DMU_HP_ECPRIO_P3_S111L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S111L */
#define IFX_DMU_HP_ECPRIO_P3_S111L_OFF (15u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S112L */
#define IFX_DMU_HP_ECPRIO_P3_S112L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S112L */
#define IFX_DMU_HP_ECPRIO_P3_S112L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S112L */
#define IFX_DMU_HP_ECPRIO_P3_S112L_OFF (16u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S113L */
#define IFX_DMU_HP_ECPRIO_P3_S113L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S113L */
#define IFX_DMU_HP_ECPRIO_P3_S113L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S113L */
#define IFX_DMU_HP_ECPRIO_P3_S113L_OFF (17u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S114L */
#define IFX_DMU_HP_ECPRIO_P3_S114L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S114L */
#define IFX_DMU_HP_ECPRIO_P3_S114L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S114L */
#define IFX_DMU_HP_ECPRIO_P3_S114L_OFF (18u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S115L */
#define IFX_DMU_HP_ECPRIO_P3_S115L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S115L */
#define IFX_DMU_HP_ECPRIO_P3_S115L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S115L */
#define IFX_DMU_HP_ECPRIO_P3_S115L_OFF (19u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S116L */
#define IFX_DMU_HP_ECPRIO_P3_S116L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S116L */
#define IFX_DMU_HP_ECPRIO_P3_S116L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S116L */
#define IFX_DMU_HP_ECPRIO_P3_S116L_OFF (20u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S117L */
#define IFX_DMU_HP_ECPRIO_P3_S117L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S117L */
#define IFX_DMU_HP_ECPRIO_P3_S117L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S117L */
#define IFX_DMU_HP_ECPRIO_P3_S117L_OFF (21u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S118L */
#define IFX_DMU_HP_ECPRIO_P3_S118L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S118L */
#define IFX_DMU_HP_ECPRIO_P3_S118L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S118L */
#define IFX_DMU_HP_ECPRIO_P3_S118L_OFF (22u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S119L */
#define IFX_DMU_HP_ECPRIO_P3_S119L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S119L */
#define IFX_DMU_HP_ECPRIO_P3_S119L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S119L */
#define IFX_DMU_HP_ECPRIO_P3_S119L_OFF (23u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S120L */
#define IFX_DMU_HP_ECPRIO_P3_S120L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S120L */
#define IFX_DMU_HP_ECPRIO_P3_S120L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S120L */
#define IFX_DMU_HP_ECPRIO_P3_S120L_OFF (24u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S121L */
#define IFX_DMU_HP_ECPRIO_P3_S121L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S121L */
#define IFX_DMU_HP_ECPRIO_P3_S121L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S121L */
#define IFX_DMU_HP_ECPRIO_P3_S121L_OFF (25u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S122L */
#define IFX_DMU_HP_ECPRIO_P3_S122L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S122L */
#define IFX_DMU_HP_ECPRIO_P3_S122L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S122L */
#define IFX_DMU_HP_ECPRIO_P3_S122L_OFF (26u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S123L */
#define IFX_DMU_HP_ECPRIO_P3_S123L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S123L */
#define IFX_DMU_HP_ECPRIO_P3_S123L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S123L */
#define IFX_DMU_HP_ECPRIO_P3_S123L_OFF (27u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S124L */
#define IFX_DMU_HP_ECPRIO_P3_S124L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S124L */
#define IFX_DMU_HP_ECPRIO_P3_S124L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S124L */
#define IFX_DMU_HP_ECPRIO_P3_S124L_OFF (28u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S125L */
#define IFX_DMU_HP_ECPRIO_P3_S125L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S125L */
#define IFX_DMU_HP_ECPRIO_P3_S125L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S125L */
#define IFX_DMU_HP_ECPRIO_P3_S125L_OFF (29u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S126L */
#define IFX_DMU_HP_ECPRIO_P3_S126L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S126L */
#define IFX_DMU_HP_ECPRIO_P3_S126L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S126L */
#define IFX_DMU_HP_ECPRIO_P3_S126L_OFF (30u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P3_Bits.S127L */
#define IFX_DMU_HP_ECPRIO_P3_S127L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P3_Bits.S127L */
#define IFX_DMU_HP_ECPRIO_P3_S127L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P3_Bits.S127L */
#define IFX_DMU_HP_ECPRIO_P3_S127L_OFF (31u)

