veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S158L */
#define IFX_DMU_HP_ECPRIO_P4_S158L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S158L */
#define IFX_DMU_HP_ECPRIO_P4_S158L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S158L */
#define IFX_DMU_HP_ECPRIO_P4_S158L_OFF (30u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P4_Bits.S159L */
#define IFX_DMU_HP_ECPRIO_P4_S159L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P4_Bits.S159L */
#define IFX_DMU_HP_ECPRIO_P4_S159L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P4_Bits.S159L */
#define IFX_DMU_HP_ECPRIO_P4_S159L_OFF (31u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S160L */
#define IFX_DMU_HP_ECPRIO_P5_S160L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S160L */
#define IFX_DMU_HP_ECPRIO_P5_S160L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S160L */
#define IFX_DMU_HP_ECPRIO_P5_S160L_OFF (0u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S161L */
#define IFX_DMU_HP_ECPRIO_P5_S161L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S161L */
#define IFX_DMU_HP_ECPRIO_P5_S161L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S161L */
#define IFX_DMU_HP_ECPRIO_P5_S161L_OFF (1u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S162L */
#define IFX_DMU_HP_ECPRIO_P5_S162L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S162L */
#define IFX_DMU_HP_ECPRIO_P5_S162L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S162L */
#define IFX_DMU_HP_ECPRIO_P5_S162L_OFF (2u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S163L */
#define IFX_DMU_HP_ECPRIO_P5_S163L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S163L */
#define IFX_DMU_HP_ECPRIO_P5_S163L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S163L */
#define IFX_DMU_HP_ECPRIO_P5_S163L_OFF (3u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S164L */
#define IFX_DMU_HP_ECPRIO_P5_S164L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S164L */
#define IFX_DMU_HP_ECPRIO_P5_S164L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S164L */
#define IFX_DMU_HP_ECPRIO_P5_S164L_OFF (4u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S165L */
#define IFX_DMU_HP_ECPRIO_P5_S165L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S165L */
#define IFX_DMU_HP_ECPRIO_P5_S165L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S165L */
#define IFX_DMU_HP_ECPRIO_P5_S165L_OFF (5u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S166L */
#define IFX_DMU_HP_ECPRIO_P5_S166L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S166L */
#define IFX_DMU_HP_ECPRIO_P5_S166L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S166L */
#define IFX_DMU_HP_ECPRIO_P5_S166L_OFF (6u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S167L */
#define IFX_DMU_HP_ECPRIO_P5_S167L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S167L */
#define IFX_DMU_HP_ECPRIO_P5_S167L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S167L */
#define IFX_DMU_HP_ECPRIO_P5_S167L_OFF (7u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S168L */
#define IFX_DMU_HP_ECPRIO_P5_S168L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S168L */
#define IFX_DMU_HP_ECPRIO_P5_S168L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S168L */
#define IFX_DMU_HP_ECPRIO_P5_S168L_OFF (8u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S169L */
#define IFX_DMU_HP_ECPRIO_P5_S169L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S169L */
#define IFX_DMU_HP_ECPRIO_P5_S169L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S169L */
#define IFX_DMU_HP_ECPRIO_P5_S169L_OFF (9u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S170L */
#define IFX_DMU_HP_ECPRIO_P5_S170L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S170L */
#define IFX_DMU_HP_ECPRIO_P5_S170L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S170L */
#define IFX_DMU_HP_ECPRIO_P5_S170L_OFF (10u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S171L */
#define IFX_DMU_HP_ECPRIO_P5_S171L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S171L */
#define IFX_DMU_HP_ECPRIO_P5_S171L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S171L */
#define IFX_DMU_HP_ECPRIO_P5_S171L_OFF (11u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S172L */
#define IFX_DMU_HP_ECPRIO_P5_S172L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S172L */
#define IFX_DMU_HP_ECPRIO_P5_S172L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S172L */
#define IFX_DMU_HP_ECPRIO_P5_S172L_OFF (12u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S173L */
#define IFX_DMU_HP_ECPRIO_P5_S173L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S173L */
#define IFX_DMU_HP_ECPRIO_P5_S173L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S173L */
#define IFX_DMU_HP_ECPRIO_P5_S173L_OFF (13u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S174L */
#define IFX_DMU_HP_ECPRIO_P5_S174L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S174L */
#define IFX_DMU_HP_ECPRIO_P5_S174L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S174L */
#define IFX_DMU_HP_ECPRIO_P5_S174L_OFF (14u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S175L */
#define IFX_DMU_HP_ECPRIO_P5_S175L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S175L */
#define IFX_DMU_HP_ECPRIO_P5_S175L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S175L */
#define IFX_DMU_HP_ECPRIO_P5_S175L_OFF (15u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S176L */
#define IFX_DMU_HP_ECPRIO_P5_S176L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S176L */
#define IFX_DMU_HP_ECPRIO_P5_S176L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_ECPRIO_P5_Bits.S176L */
#define IFX_DMU_HP_ECPRIO_P5_S176L_OFF (16u)

/** \brief Length for Ifx_DMU_HP_ECPRIO_P5_Bits.S177L */
#define IFX_DMU_HP_ECPRIO_P5_S177L_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_ECPRIO_P5_Bits.S177L */
#define IFX_DMU_HP_ECPRIO_P5_S177L_MSK (0x1u)

